# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# Пример:
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

s = int(input("Введи сколько сделано журавликов S: ")) 

x = s/6
petia = x
sergei = x
kata = (x+x)*2

print (f"Петя сделал: {petia}")
print (f"Серёжа сделал: {sergei}")
print (f"Катя сделала: {kata}")